/*
版权声明：
深圳市小二极客科技（小R科技）旗下：WIFI机器人网·机器人创意工作室版权所有 www.wifi-robots.com
您可以任意修改本程序，并应用于自行研发的智能小车机器人及其他电子产品上，但是禁止用于商业牟利。
小R科技保留付诸法律起诉侵权的权利！2015-8-22
By WIFI机器人网·机器人创意工作室
*/

#include "LCD_12864.h"

uint8 code AC_TABLE[] ={
                                   0x80,0x81,0x82,0x83,0x84,0x85,0x86,0x87,// 第一行汉字位置      
                                   0x90,0x91,0x92,0x93,0x94,0x95,0x96,0x97, // 第二行汉字位置     
                                   0x88,0x89,0x8a,0x8b,0x8c,0x8d,0x8e,0x8f,// 第三行汉字位置      
                                   0x98,0x99,0x9a,0x9b,0x9c,0x9d,0x9e,0x9f, // 第四行汉字位置     
                                  		};

/*
*********************************************************************************************************
** 函数名称 ：LCD_SendByte()
** 函数功能 ：串口发送一个字节
** 入口参数 ：Dbyte
** 出口参数 ：无
powered by tianyalu
*********************************************************************************************************
*/
void LCD_SendByte(uint8 Dbyte)
{
     uint8 i;
     for(i = 0;i < 8;i++)
     {
		LCD_SCK = 0;
		if ((Dbyte << i) & 0x80) 
		{
		   LCD_SD = 1;//检查最高位
		}
		else 
		{
		   LCD_SD = 0;
		}
		LCD_SCK = 1;
		LCD_SCK = 0;
     }
}
/*
*********************************************************************************************************
** 函数名称 ：Wricom()
** 函数功能 ：串口发送命令
** 入口参数 ：一个字节的命令Cbyte
** 出口参数 ：无
powered by tianyalu
*********************************************************************************************************
*/
void Wricom( uint8 Cbyte )
{
	 LCD_CS = 1;
	 Delay_Ms(5);				//等待液晶处理数据
     LCD_SendByte(0xf8);            //11111,RW(0),RS(0),0
     LCD_SendByte(0xf0 & Cbyte);      //高四位
     LCD_SendByte(0xf0 & Cbyte << 4);	//低四位(先执行<<)
	 LCD_CS = 0;
}
/*
*********************************************************************************************************
** 函数名称 ：Wridat()
** 函数功能 ：串口发送数据
** 入口参数 ：一个字节的数据Dbyte
** 出口参数 ：无
powered by tianyalu
*********************************************************************************************************
*/
void Wridat( uint8 Dbyte )
{
	 LCD_CS = 1;
	 Delay_Ms(5);				//等待液晶处理数据
     LCD_SendByte(0xfa);            //11111,RW(0),RS(1),0
     LCD_SendByte(0xf0 & Dbyte);      //高四位
     LCD_SendByte(0xf0 & Dbyte << 4);	//低四位(先执行<<)
	 LCD_CS = 0;
}
/*
*********************************************************************************************************
** 函数名称 ：Dis_string()
** 函数功能 ：显示字符串 (按指定位置)
** 入口参数 ：行、列、显示的数据指针
** 出口参数 ：无
powered by tianyalu
*********************************************************************************************************
*/
void Dis_string( uint8 row,
                 uint8 col,
				 uint8 *puts )
{   
	uint8 i = 0;
    Wricom(0x30);      // 8BitMCU,基本指令集合
    Wricom(AC_TABLE[8 * row + col]);      // 起始位置
    while (*puts != '\0')      // 判断字符串是否显示完毕
    {
        if (col == 8)            // 判断换行
        {      // 若不判断,则自动从第一行到第三行
            col = 0;
            row++;
        }
        if (row == 4)
		{
		    row = 0;      // 一屏显示完,回到屏左上角
	     }
        Wricom(AC_TABLE[8 * row + col]);
        Wridat(*puts);      // 一个汉字要写两次
        puts++;
        Wridat(*puts);
        puts++;
        col++;
		i++;
     }
}
/*
*********************************************************************************************************
** 函数名称 ：Dis_string1()
** 函数功能 ：显示字符串(按整页显示) 
** 入口参数 ：行、列、显示的数据指针
** 出口参数 ：无
powered by tianyalu
*********************************************************************************************************
*/
void Dis_string1( uint8 row,
                 uint8 col,
				 uint8 *puts )
{   
    uint8 i = 0;
    Wricom(0x30);      // 8BitMCU,基本指令集合
    Wricom(AC_TABLE[8 * row + col]);      // 起始位置
    while (i != 32)      // 判断字符串是否显示完毕
    {
       if (col == 8)            // 判断换行
       {      // 若不判断,则自动从第一行到第三行
          col = 0;
          row++;
       }
       if (row == 4)
	   { 
	       row = 0;      // 一屏显示完,回到屏左上角
	    }
       Wricom(AC_TABLE[8 * row + col]);
       Wridat(*puts);      // 一个汉字要写两次
       puts++;
       Wridat(*puts);
       puts++;
       col++;
	   i++;
    }
}
/*
*********************************************************************************************************
** 函数名称 ：Dis_bmp()
** 函数功能 ：显示图像 
** 入口参数 ：显示的数据指针
** 出口参数 ：无
powered by tianyalu
*********************************************************************************************************
*/
void Dis_bmp(uint8 *puts)
{
    unsigned int x = 0;
    uint8 i, j;
    Wricom(0x34);      // 8Bit扩充指令集,即使是36H也要写两次
    Wricom(0x36);      // 绘图ON,基本指令集里面36H不能开绘图
    for (i=0; i<32; i++)            //12864实际为256x32
    {
       Wricom(0x80|i);      // 行位置
       Wricom(0x80);      // 列位置
       for(j=0; j<32; j++)      // 256/8=32 byte
       {            // 列位置每行自动增加
          Wridat(puts[x]);
          x++;
       }
    }
}
/*
*********************************************************************************************************
** 函数名称 ：Lcd_Init()
** 函数功能 ：12864初始化 
** 入口参数 ：无
** 出口参数 ：无
*********************************************************************************************************
*/
void Lcd_Init(void)
{
   Wricom(0x30);// 基本指令
   Wricom(0x03);// AC归0,不改变DDRAM内容
   Wricom(0x0c);// 开显示,关光标,不闪烁
   Wricom(0x01);// 清屏
   Wricom(0x06);// 指定在资料写入或读取时，光标的移动方向

   Dis_string(0,0,"每个创客都应该拥有一台机器人www.wifi-robots.com小R科技欢迎您");
}
/*
*********************************************************************************************************
** 函数名称 ：Clear_txt()
** 函数功能 ：清文本文字(写ASCII码) 
** 入口参数 ：无
** 出口参数 ：无
powered by tianyalu
*********************************************************************************************************
*/
void Clear_txt( void )
{
    uint8 i;
    Wricom(0x30);
    Wricom(0x80);      
    for(i=0; i<64; i++)
	{
       Wridat(0x20);// 填空格(空格对应ASCII码为0x20)
	}
}
 /*
*********************************************************************************************************
** 函数名称 ：Clear_bmp()
** 函数功能 ： 清图像（对应位写0、1）
** 入口参数 ：无
** 出口参数 ：无
powered by tianyalu
*********************************************************************************************************
*/
void Clear_bmp( void )
{
   uint8 i, j;
   Wricom(0x34);      // 8Bit扩充指令集,即使是36H也要写两次
   Wricom(0x36);      // 绘图ON,基本指令集里面36H不能开绘图
   for(i=0; i<32; i++)            // 12864实际为256x32
   {
      Wricom(0x80|i);      // 行位置
      Wricom(0x80);      // 列位置
      for(j=0; j<32; j++)
	  {           //256/8=32 byte
         Wridat(0);// 写0(1为显示位，0为非显示位)
	  }
   }
}
